nc: 1  # number of classes

scales:  # model compound scaling constants
  n: [0.50, 0.25, 1024]  # summary: 294 layers, 2,855,056 params, 10.6 GFLOPs
  s: [0.50, 0.50, 1024]  # summary: 294 layers, 9,938,592 params, 35.7 GFLOPs
  m: [0.50, 1.00, 512]   # summary: 314 layers, 22,505,376 params, 123.5 GFLOPs
  l: [1.00, 1.00, 512]   # summary: 510 layers, 28,756,992 params, 145.1 GFLOPs
  x: [1.00, 1.50, 512]   # summary: 510 layers, 64,387,264 params, 324.6 GFLOPs

# ----------------------- backbone ----------------------- #
backbone:
  # [from, repeats, module, args]
  - [-1, 1,  Conv,    [64,   3, 2]]    # 0-P1/2
  - [-1, 1,  Conv,    [128,  3, 2]]    # 1-P2/4
  - [-1, 3,  TEA,    [12,   12]]      # 2
  - [-1, 1,  Conv,    [256,  3, 2]]    # 3-P3/8
  - [-1, 3,  TEA,    [64,   64]]      # 4
  - [-1, 1,  Conv,    [512,  3, 2]]    # 5-P4/16
  - [-1, 3,  PCA,   [512,  512]]     # 6
  - [-1, 1,  Conv,    [1024, 3, 2]]    # 7-P5/32
  - [-1, 4,  PCA,   [1024, 1024]]    # 8

# ------------------------- head ------------------------- #
head:
  - [-1,1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]     # cat backbone P4
  - [-1, 4, PCA,      [512, 512]]  # 11

  - [-1,        1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1,   4], 1, Concat,     [1]]     # cat backbone P3
  - [-1, 4, PCA,      [256, 256]]  # 14

  - [-1,        1, Conv,       [256, 3, 2]]
  - [[-1,  11], 1, Concat,     [1]]     # cat head P4
  - [-1,     2, PCA,[512, 512]]  # 17

  - [-1,        1, Conv,       [512, 3, 2]]
  - [[-1,   8], 1, Concat,     [1]]     # cat head P5
  - [-1,        2, TEA,       [1024, 1024]] # 20 (P5/32‑large)

  # final Segment head
  - [[14,17,20], 1, Segment,   [nc, 32, 256]]
